vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WLxx_DFP.pdsc
        <book name="https://developer.arm.com/documentation/dui0553/latest" title="Cortex-M4 Generic User Guide"/>
        <book name="https://www.st.com/resource/en/reference_manual/rm0461-stm32wlex-advanced-armbased-32bit-mcus-with-subghz-radio-solution-stmicroelectronics.pdf" title="STM32WLEx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32wle5c8.pdf" title="STM32WLE5xx STM32WLE4xx Data Sheet"/>

        <description >
High-performance STM32WL MCUs with Arm Cortex-M4 core, MPU, DSP, ART Accelerator, 1.25 DMIPS at 48 MHz.
          </description>

        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32WLE5JCIx  *************************** -->
        <device Dname="STM32WLE5JCIx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLxx_CM4.FLM"  start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />

          <feature type="BGA" n="73"/>
        </device>

        <!-- *************************  Device 'STM32WLE5CCUx  *************************** -->
        <device Dname="STM32WLE5CCUx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLxx_CM4.FLM"  start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32WLE5CBUx'  ************************** -->
        <device Dname="STM32WLE5CBUx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00004000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_128.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20008000" RAMsize="0x8000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WLE5JBIx'  ************************** -->
        <device Dname="STM32WLE5JBIx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00004000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_128.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20008000" RAMsize="0x8000" default="1" />

          <feature type="BGA" n="73"/>
        </device>

        <!-- *************************  Device 'STM32WLE5UBYx'  **************************
        <device Dname="STM32WLE5UBYx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00004000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_128.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20008000" RAMsize="0x8000" default="1" />

          <feature type="CSP" n="59"/>
        </device>-->

        <!-- ################################### 64 KB ################################### -->
        <!-- *************************  Device 'STM32WLE5C8Ux'  ************************** -->
        <device Dname="STM32WLE5C8Ux">
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00005000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_64.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20008000" RAMsize="0x5000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WLE5J8Ix'  ************************** -->
        <device Dname="STM32WLE5J8Ix">
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00005000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_64.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20008000" RAMsize="0x5000" default="1" />

          <feature type="BGA" n="73"/>
        </device>

        <!-- *************************  Device 'STM32WLE5U8Yx'  **************************
        <device Dname="STM32WLE5U8Yx">
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00005000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_64.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20008000" RAMsize="0x5000" default="1" />

          <feature type="CSP" n="59"/>
        </device>-->
      </subFamily>

      <!-- ************************  Subfamily 'STM32WLE4 Single Core'  ************************** -->
      <subFamily DsubFamily="STM32WLE4">
        <processor Dcore="Cortex-M4"  DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="48000000"/>
        <debug svd="CMSIS/SVD/STM32WLE5_CM4.svd"/>
        <compile define="STM32WLE4xx"/>

