vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32WLxx_DFP.pdsc
        <book name="https://developer.arm.com/documentation/dui0553/latest" title="Cortex-M4 Generic User Guide"/>
        <book name="https://www.st.com/resource/en/reference_manual/rm0461-stm32wlex-advanced-armbased-32bit-mcus-with-subghz-radio-solution-stmicroelectronics.pdf" title="STM32WLEx Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32wle5c8.pdf" title="STM32WLE5xx STM32WLE4xx Data Sheet"/>

        <description >
High-performance STM32WL MCUs with Arm Cortex-M4 core, MPU, DSP, ART Accelerator, 1.25 DMIPS at 48 MHz.
        </description>

        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32WLE4JCIx  *************************** -->
        <device Dname="STM32WLE4JCIx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLxx_CM4.FLM"  start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />

          <feature type="BGA" n="73"/>
        </device>

        <!-- *************************  Device 'STM32WLE4CCUx  *************************** -->
        <device Dname="STM32WLE4CCUx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00008000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLxx_CM4.FLM"  start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32WLE4CBUx'  ************************** -->
        <device Dname="STM32WLE4CBUx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00004000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_128.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20008000" RAMsize="0x8000" default="1" />

          <feature type="QFP" n="48"/>
         </device>

        <!-- *************************  Device 'STM32WLE4JBIx'  ************************** -->
        <device Dname="STM32WLE4JBIx">
          <memory name="SRAM1" access="rwx"                start="0x20000000" size="0x00004000" default="1" init="0" />
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00008000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_128.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20008000" RAMsize="0x8000" default="1" />

          <feature type="BGA" n="73"/>
        </device>

        <!-- ################################### 64 KB ################################### -->
        <!-- *************************  Device 'STM32WLE4C8Ux'  ************************** -->
        <device Dname="STM32WLE4C8Ux">
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00005000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_64.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20008000" RAMsize="0x5000" default="1" />

          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32WLE4J8Ix'  ************************** -->
        <device Dname="STM32WLE4J8Ix">
          <memory name="SRAM2" access="rwx"                start="0x20008000" size="0x00005000" default="1" init="0" />
          <memory name="FLASH" access="rx"                 start="0x08000000" size="0x00010000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32WLExx_64.FLM"  start="0x08000000" size="0x00010000" RAMstart="0x20008000" RAMsize="0x5000" default="1" />

          <feature type="BGA" n="73"/>
        </device>
      </subFamily>

    </family>

  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="STM32WL">
      <description>STMicroelectronics STM32WL devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32WL*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32WL3*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32WL CMSIS">
      <description>STMicroelectronics STM32WL Device and CMSIS-CORE</description>
      <require condition="STM32WL"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

  </conditions>

  <components>
    <!-- CubeMX Generator -->
    <component generator="CubeMX" Cclass="Device" Cgroup="CubeMX" Cversion="1.0.0" condition="STM32WL CMSIS">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CUBE_MX
        #define CMSIS_device_header "stm32wlxx.h"
      </RTE_Components_h>
      <files>
        <file category="doc" name="https://open-cmsis-pack.github.io/cmsis-toolbox/CubeMX"/>
      </files>
    </component>
  </components>

  <csolution>
    <!-- CubeMX Basic CMSIS Solution template -->
    <template name="CubeMX Basic solution" path="Templates/CubeMX" file="CubeMX.csolution.yml" condition="STM32WL">
      <description>Create a CubeMX basic solution with project</description>
    </template>
    <!-- CubeMX Dual Core CMSIS Solution template -->
    <template name="CubeMX Dual Core solution" path="Templates/CubeMX_DualCore" file="CubeMX_DualCore.csolution.yml" condition="STM32WL">
      <description>Create a CubeMX Dual Core solution with CM4 and CM0PLUS projects</description>
    </template>
  </csolution>
</package>
